STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_tsc.h
/**
  ******************************************************************************
  * @file    stm32u5xx_ll_tsc.h
  * @brief   Header file of TSC LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2021-2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************

    Table 1. IOs for the STM32U5xx devices
    +--------------------------------+
    |       IOs    |   TSC functions |
    |--------------|-----------------|
    |   PB12 (AF9) |   TSC_G1_IO1    |
    |   PB13 (AF9) |   TSC_G1_IO2    |
    |   PB14 (AF9) |   TSC_G1_IO3    |
    |   PC3 (AF9)  |   TSC_G1_IO4    |
    |--------------|-----------------|
    |   PB4 (AF9)  |   TSC_G2_IO1    |
    |   PB5 (AF9)  |   TSC_G2_IO2    |
    |   PB6 (AF9)  |   TSC_G2_IO3    |
    |   PB7 (AF9)  |   TSC_G2_IO4    |
    |--------------|-----------------|
    |   PC2 (AF9)  |   TSC_G3_IO1    |
    |   PC10 (AF9) |   TSC_G3_IO2    |
    |   PC11 (AF9) |   TSC_G3_IO3    |
    |   PC12 (AF9) |   TSC_G3_IO4    |
    |--------------|-----------------|
    |   PC6 (AF9)  |   TSC_G4_IO1    |
    |   PC7 (AF9)  |   TSC_G4_IO2    |
    |   PC8 (AF9)  |   TSC_G4_IO3    |
    |   PC9 (AF9)  |   TSC_G4_IO4    |
    |--------------|-----------------|
    |   PE10 (AF9) |   TSC_G5_IO1    |
    |   PE11 (AF9) |   TSC_G5_IO2    |
    |   PE12 (AF9) |   TSC_G5_IO3    |
    |   PE13 (AF9) |   TSC_G5_IO4    |
    |--------------|-----------------|
    |   PD10 (AF9) |   TSC_G6_IO1    |
    |   PD11 (AF9) |   TSC_G6_IO2    |
    |   PD12 (AF9) |   TSC_G6_IO3    |
    |   PD13 (AF9) |   TSC_G6_IO4    |
    |--------------|-----------------|
    |   PE2 (AF9)  |   TSC_G7_IO1    |
    |   PE3 (AF9)  |   TSC_G7_IO2    |
    |   PE4 (AF9)  |   TSC_G7_IO3    |
    |   PE5 (AF9)  |   TSC_G7_IO4    |
    |--------------|-----------------|
    |   PF14 (AF9) |   TSC_G8_IO1    |
    |   PF15 (AF9) |   TSC_G8_IO2    |
    |   PG0 (AF9)  |   TSC_G8_IO3    |
    |   PG1 (AF9)  |   TSC_G8_IO4    |
    |--------------|-----------------|
    |   PB10 (AF9) |   TSC_SYNC      |
    |   PD2 (AF9)  |                 |
    +--------------------------------+

  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32U5XX_LL_TSC_H
#define STM32U5XX_LL_TSC_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32u5xx.h"


/** @addtogroup STM32U5xx_LL_Driver
  * @{
  */

/** @defgroup TSC_LL TSC
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
#if defined(TSC_IOCCR_G8_IO1)
#define  TSC_NB_OF_GROUPS  (8U)
#else
#define  TSC_NB_OF_GROUPS  (7U)
#endif /* TSC_IOCCR_G8_IO1 */

/* Private functions ---------------------------------------------------------*/
/** @defgroup TSC_LL_Private_Functions TSC Private Functions
  * @{
  */

/**
  * @brief  Utility function used to set the acquired groups mask.
  * @param  iomask Channels IOs mask
  * @retval Acquired groups mask
  */
static uint32_t TSC_extract_groups(uint32_t iomask)
{
  uint32_t groups = 0UL;
  uint32_t idx;

  for (idx = 0UL; idx < (uint32_t)TSC_NB_OF_GROUPS; idx++)
  {
    if ((iomask & (0x0FUL << (idx * 4UL))) != 0UL)
    {
      groups |= (1UL << idx);
    }
  }

  return groups;
}
/**
  * @}
  */
/* Private macros ------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup TSC_LL_Exported_Constants TSC Exported Constants
  * @{
  */

/** @defgroup TSC_LL_EC_Acquisition_Mode TSC Acquisition Mode
  * @{
  */
/** Normal acquisition mode (acquisition starts as soon as START bit is set) */
#define LL_TSC_ACQ_MODE_NORMAL     0x00000000UL
/** Synchronized acquisition mode (acquisition starts if START bit is set and
     when the selected signal is detected on the SYNC input pin) */
#define LL_TSC_ACQ_MODE_SYNCHRO    TSC_CR_AM
/**
  * @}
  */

/** @defgroup TSC_LL_EC_Synchro_Pin_Polarity TSC Synchro Pin Polarity
  * @{
  */
#define LL_TSC_SYNC_POLARITY_FALLING  0x00000000UL   /*!< Falling edge only          */
#define LL_TSC_SYNC_POLARITY_RISING   TSC_CR_SYNCPOL /*!< Rising edge and high level */
/**
  * @}
  */

/** @defgroup TSC_LL_EC_IO_Default_Mode TSC IO Default Mode
  * @{
  */
#define LL_TSC_IODEF_OUT_PP_LOW    0x00000000UL /*!< I/Os are forced to output push-pull low */
#define LL_TSC_IODEF_IN_FLOAT      TSC_CR_IODEF /*!< I/Os are in input floating              */
/**
  * @}
  */

/** @defgroup TSC_LL_EC_Max_Count_Value TSC Max Count Value
  * @{
  */
/** 255 maximum number of charge transfer pulses   */
#define LL_TSC_MAX_COUNT_VALUE_255     0x00000000UL
/** 511 maximum number of charge transfer pulses   */
#define LL_TSC_MAX_COUNT_VALUE_511     TSC_CR_MCV_0
/** 1023 maximum number of charge transfer pulses  */
#define LL_TSC_MAX_COUNT_VALUE_1023    TSC_CR_MCV_1
/** 2047 maximum number of charge transfer pulses  */
#define LL_TSC_MAX_COUNT_VALUE_2047    (TSC_CR_MCV_1 | TSC_CR_MCV_0)
/** 4095 maximum number of charge transfer pulses  */
#define LL_TSC_MAX_COUNT_VALUE_4095    TSC_CR_MCV_2
/** 8191 maximum number of charge transfer pulses  */
#define LL_TSC_MAX_COUNT_VALUE_8191    (TSC_CR_MCV_2 | TSC_CR_MCV_0)
/** 16383 maximum number of charge transfer pulses */
#define LL_TSC_MAX_COUNT_VALUE_16383   (TSC_CR_MCV_2 | TSC_CR_MCV_1)
/**
  * @}
  */

/** @defgroup TSC_LL_EC_Pulse_Generator_Prescaler TSC Pulse Generator Prescaler
  * @{
  */
/** Pulse Generator HCLK Div1   */
#define LL_TSC_PULSE_GEN_PRESCALER_DIV1       0x00000000UL
/** Pulse Generator HCLK Div2   */
#define LL_TSC_PULSE_GEN_PRESCALER_DIV2       TSC_CR_PGPSC_0
/** Pulse Generator HCLK Div4   */
#define LL_TSC_PULSE_GEN_PRESCALER_DIV4       TSC_CR_PGPSC_1
/** Pulse Generator HCLK Div8   */
#define LL_TSC_PULSE_GEN_PRESCALER_DIV8       (TSC_CR_PGPSC_1 | TSC_CR_PGPSC_0)
/** Pulse Generator HCLK Div16  */
#define LL_TSC_PULSE_GEN_PRESCALER_DIV16      TSC_CR_PGPSC_2
/** Pulse Generator HCLK Div32  */
#define LL_TSC_PULSE_GEN_PRESCALER_DIV32      (TSC_CR_PGPSC_2 | TSC_CR_PGPSC_0)
/** Pulse Generator HCLK Div64  */
#define LL_TSC_PULSE_GEN_PRESCALER_DIV64      (TSC_CR_PGPSC_2 | TSC_CR_PGPSC_1)
/** Pulse Generator HCLK Div128 */
#define LL_TSC_PULSE_GEN_PRESCALER_DIV128     (TSC_CR_PGPSC_2 | TSC_CR_PGPSC_1 | TSC_CR_PGPSC_0)
/**
  * @}
  */

/** @defgroup TSC_LL_EC_Spread_Spectrum TSC Spread Spectrum
  * @{
  */
#define  LL_TSC_SPREAD_SPECTRUM_ENABLE       1UL /*!< Spread Spectrum Enable  */
#define  LL_TSC_SPREAD_SPECTRUM_DISABLE      0UL /*!< Spread Spectrum Disable */
/**
  * @}
  */

/** @defgroup TSC_LL_EC_Charge_Transfer_Pulse_High TSC Charge Transfer Pulse High
  * @{
  */
/** Charge transfer pulse high during 1 cycle (PGCLK)   */
#define LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_1CYCLE   0x00000000UL
/** Charge transfer pulse high during 2 cycles (PGCLK)  */
#define LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_2CYCLES  TSC_CR_CTPH_0
/** Charge transfer pulse high during 3 cycles (PGCLK)  */
#define LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_3CYCLES  TSC_CR_CTPH_1
/** Charge transfer pulse high during 4 cycles (PGCLK)  */
#define LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_4CYCLES  (TSC_CR_CTPH_1 | TSC_CR_CTPH_0)
/** Charge transfer pulse high during 5 cycles (PGCLK)  */
#define LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_5CYCLES  TSC_CR_CTPH_2
/** Charge transfer pulse high during 6 cycles (PGCLK)  */
#define LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_6CYCLES  (TSC_CR_CTPH_2 | TSC_CR_CTPH_0)
/** Charge transfer pulse high during 7 cycles (PGCLK)  */
#define LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_7CYCLES  (TSC_CR_CTPH_2 | TSC_CR_CTPH_1)
/** Charge transfer pulse high during 8 cycles (PGCLK)  */
#define LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_8CYCLES  (TSC_CR_CTPH_2 | TSC_CR_CTPH_1 | TSC_CR_CTPH_0)
/** Charge transfer pulse high during 9 cycles (PGCLK)  */
#define LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_9CYCLES  TSC_CR_CTPH_3
/** Charge transfer pulse high during 10 cycles (PGCLK) */
#define LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_10CYCLES (TSC_CR_CTPH_3 | TSC_CR_CTPH_0)
/** Charge transfer pulse high during 11 cycles (PGCLK) */
#define LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_11CYCLES (TSC_CR_CTPH_3 | TSC_CR_CTPH_1)
/** Charge transfer pulse high during 12 cycles (PGCLK) */
#define LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_12CYCLES (TSC_CR_CTPH_3 | TSC_CR_CTPH_1 | TSC_CR_CTPH_0)
/** Charge transfer pulse high during 13 cycles (PGCLK) */
#define LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_13CYCLES (TSC_CR_CTPH_3 | TSC_CR_CTPH_2)
/** Charge transfer pulse high during 14 cycles (PGCLK) */
#define LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_14CYCLES (TSC_CR_CTPH_3 | TSC_CR_CTPH_2 | TSC_CR_CTPH_0)
/** Charge transfer pulse high during 15 cycles (PGCLK) */
#define LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_15CYCLES (TSC_CR_CTPH_3 | TSC_CR_CTPH_2 | TSC_CR_CTPH_1)
/** Charge transfer pulse high during 16 cycles (PGCLK) */
#define LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_16CYCLES (TSC_CR_CTPH_3 | TSC_CR_CTPH_2 | TSC_CR_CTPH_1 | TSC_CR_CTPH_0)
/**
  * @}
  */

/** @defgroup TSC_LL_EC_Charge_Transfer_Pulse_Low TSC Charge Transfer Pulse Low
  * @{
  */
/** Charge transfer pulse low during 1 cycle (PGCLK)   */
#define LL_TSC_CHARGE_TRANSFER_PULSE_LOW_1CYCLE         0x00000000UL
/** Charge transfer pulse low during 2 cycles (PGCLK)  */
#define LL_TSC_CHARGE_TRANSFER_PULSE_LOW_2CYCLES        TSC_CR_CTPL_0
/** Charge transfer pulse low during 3 cycles (PGCLK)  */
#define LL_TSC_CHARGE_TRANSFER_PULSE_LOW_3CYCLES        TSC_CR_CTPL_1
/** Charge transfer pulse low during 4 cycles (PGCLK)  */
#define LL_TSC_CHARGE_TRANSFER_PULSE_LOW_4CYCLES        (TSC_CR_CTPL_1 | TSC_CR_CTPL_0)
/** Charge transfer pulse low during 5 cycles (PGCLK)  */
#define LL_TSC_CHARGE_TRANSFER_PULSE_LOW_5CYCLES        TSC_CR_CTPL_2
/** Charge transfer pulse low during 6 cycles (PGCLK)  */
#define LL_TSC_CHARGE_TRANSFER_PULSE_LOW_6CYCLES        (TSC_CR_CTPL_2 | TSC_CR_CTPL_0)
/** Charge transfer pulse low during 7 cycles (PGCLK)  */
#define LL_TSC_CHARGE_TRANSFER_PULSE_LOW_7CYCLES        (TSC_CR_CTPL_2 | TSC_CR_CTPL_1)
/** Charge transfer pulse low during 8 cycles (PGCLK)  */
#define LL_TSC_CHARGE_TRANSFER_PULSE_LOW_8CYCLES        (TSC_CR_CTPL_2 | TSC_CR_CTPL_1 | TSC_CR_CTPL_0)
/** Charge transfer pulse low during 9 cycles (PGCLK)  */
#define LL_TSC_CHARGE_TRANSFER_PULSE_LOW_9CYCLES        TSC_CR_CTPL_3
/** Charge transfer pulse low during 10 cycles (PGCLK) */
#define LL_TSC_CHARGE_TRANSFER_PULSE_LOW_10CYCLES       (TSC_CR_CTPL_3 | TSC_CR_CTPL_0)
/** Charge transfer pulse low during 11 cycles (PGCLK) */
#define LL_TSC_CHARGE_TRANSFER_PULSE_LOW_11CYCLES       (TSC_CR_CTPL_3 | TSC_CR_CTPL_1)
/** Charge transfer pulse low during 12 cycles (PGCLK) */
#define LL_TSC_CHARGE_TRANSFER_PULSE_LOW_12CYCLES       (TSC_CR_CTPL_3 | TSC_CR_CTPL_1 | TSC_CR_CTPL_0)
/** Charge transfer pulse low during 13 cycles (PGCLK) */
#define LL_TSC_CHARGE_TRANSFER_PULSE_LOW_13CYCLES       (TSC_CR_CTPL_3 | TSC_CR_CTPL_2)
/** Charge transfer pulse low during 14 cycles (PGCLK) */
#define LL_TSC_CHARGE_TRANSFER_PULSE_LOW_14CYCLES       (TSC_CR_CTPL_3 | TSC_CR_CTPL_2 | TSC_CR_CTPL_0)
/** Charge transfer pulse low during 15 cycles (PGCLK) */
#define LL_TSC_CHARGE_TRANSFER_PULSE_LOW_15CYCLES       (TSC_CR_CTPL_3 | TSC_CR_CTPL_2 | TSC_CR_CTPL_1)
/** Charge transfer pulse low during 16 cycles (PGCLK) */
#define LL_TSC_CHARGE_TRANSFER_PULSE_LOW_16CYCLES       (TSC_CR_CTPL_3 | TSC_CR_CTPL_2 | TSC_CR_CTPL_1 | TSC_CR_CTPL_0)
/**
  * @}
  */

