STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_tsc.h
/** @defgroup TSC_LL_EC_Interrupt TSC Interrupts
  * @{
  */
#define LL_TSC_IT_EOA              TSC_IER_EOAIE /*!< End of acquisition interrupt enable */
#define LL_TSC_IT_MCE              TSC_IER_MCEIE /*!< Max count error interrupt enable    */
/**
  * @}
  */

/** @defgroup TSC_LL_EC_Flags TSC Flags
  * @{
  */
#define LL_TSC_FLAG_EOA            TSC_ISR_EOAF /*!< End of acquisition flag */
#define LL_TSC_FLAG_MCE            TSC_ISR_MCEF /*!< Max count error flag    */
/**
  * @}
  */

/** @defgroup TSC_LL_EC_Group_Index TSC Group Index
  * @{
  */
#define  LL_TSC_GROUP1_IDX          (0x00UL) /*!< TSC Group1 index */
#define  LL_TSC_GROUP2_IDX          (0x01UL) /*!< TSC Group2 index */
#define  LL_TSC_GROUP3_IDX          (0x02UL) /*!< TSC Group3 index */
#define  LL_TSC_GROUP4_IDX          (0x03UL) /*!< TSC Group4 index */
#define  LL_TSC_GROUP5_IDX          (0x04UL) /*!< TSC Group5 index */
#define  LL_TSC_GROUP6_IDX          (0x05UL) /*!< TSC Group6 index */
#define  LL_TSC_GROUP7_IDX          (0x06UL) /*!< TSC Group7 index */
#if defined(TSC_IOCCR_G8_IO1)
#define  LL_TSC_GROUP8_IDX          (0x07UL) /*!< TSC Group8 index */
#endif /* TSC_IOCCR_G8_IO1 */
/**
  * @}
  */

/** @defgroup TSC_LL_EC_Groups TSC Groups
  * @{
  */
#define LL_TSC_GROUP1               (0x1UL << LL_TSC_GROUP1_IDX) /*!< TSC Group1 */
#define LL_TSC_GROUP2               (0x1UL << LL_TSC_GROUP2_IDX) /*!< TSC Group2 */
#define LL_TSC_GROUP3               (0x1UL << LL_TSC_GROUP3_IDX) /*!< TSC Group3 */
#define LL_TSC_GROUP4               (0x1UL << LL_TSC_GROUP4_IDX) /*!< TSC Group4 */
#define LL_TSC_GROUP5               (0x1UL << LL_TSC_GROUP5_IDX) /*!< TSC Group5 */
#define LL_TSC_GROUP6               (0x1UL << LL_TSC_GROUP6_IDX) /*!< TSC Group6 */
#define LL_TSC_GROUP7               (0x1UL << LL_TSC_GROUP7_IDX) /*!< TSC Group7 */
#if defined(TSC_IOCCR_G8_IO1)
#define LL_TSC_GROUP8               (0x1UL << LL_TSC_GROUP8_IDX) /*!< TSC Group8 */
#endif /* TSC_IOCCR_G8_IO1 */

#define LL_TSC_GROUPX_NOT_SUPPORTED 0xFF000000UL                 /*!< TSC GroupX not supported */
/**
  * @}
  */

/** @defgroup TSC_LL_EC_Groups_IOs TSC Groups IOs
  * @{
  */
#define LL_TSC_GROUP1_IO1           TSC_IOCCR_G1_IO1             /*!< TSC Group1 IO1 */
#define LL_TSC_GROUP1_IO2           TSC_IOCCR_G1_IO2             /*!< TSC Group1 IO2 */
#define LL_TSC_GROUP1_IO3           TSC_IOCCR_G1_IO3             /*!< TSC Group1 IO3 */
#if defined(TSC_IOCCR_G1_IO4)
#define LL_TSC_GROUP1_IO4           TSC_IOCCR_G1_IO4             /*!< TSC Group1 IO4 */
#else
#define LL_TSC_GROUP1_IO4           LL_TSC_GROUPX_NOT_SUPPORTED  /*!< TSC Group1 IO4 not supported */
#endif /* TSC_IOCCR_G1_IO4 */

#define LL_TSC_GROUP2_IO1           TSC_IOCCR_G2_IO1             /*!< TSC Group2 IO1 */
#define LL_TSC_GROUP2_IO2           TSC_IOCCR_G2_IO2             /*!< TSC Group2 IO2 */
#define LL_TSC_GROUP2_IO3           TSC_IOCCR_G2_IO3             /*!< TSC Group2 IO3 */
#define LL_TSC_GROUP2_IO4           TSC_IOCCR_G2_IO4             /*!< TSC Group2 IO4 */

#if defined(TSC_IOCCR_G3_IO1)
#define LL_TSC_GROUP3_IO1           TSC_IOCCR_G3_IO1             /*!< TSC Group3 IO1 */
#else
#define LL_TSC_GROUP3_IO1           LL_TSC_GROUPX_NOT_SUPPORTED  /*!< TSC Group3 IO1 not supported */
#endif /* TSC_IOCCR_G3_IO1 */
#define LL_TSC_GROUP3_IO2           TSC_IOCCR_G3_IO2             /*!< TSC Group3 IO2 */
#define LL_TSC_GROUP3_IO3           TSC_IOCCR_G3_IO3             /*!< TSC Group3 IO3 */
#define LL_TSC_GROUP3_IO4           TSC_IOCCR_G3_IO4             /*!< TSC Group3 IO4 */

#define LL_TSC_GROUP4_IO1           TSC_IOCCR_G4_IO1             /*!< TSC Group4 IO1 */
#define LL_TSC_GROUP4_IO2           TSC_IOCCR_G4_IO2             /*!< TSC Group4 IO2 */
#define LL_TSC_GROUP4_IO3           TSC_IOCCR_G4_IO3             /*!< TSC Group4 IO3 */
#define LL_TSC_GROUP4_IO4           TSC_IOCCR_G4_IO4             /*!< TSC Group4 IO4 */

#define LL_TSC_GROUP5_IO1           TSC_IOCCR_G5_IO1             /*!< TSC Group5 IO1 */
#define LL_TSC_GROUP5_IO2           TSC_IOCCR_G5_IO2             /*!< TSC Group5 IO2 */
#define LL_TSC_GROUP5_IO3           TSC_IOCCR_G5_IO3             /*!< TSC Group5 IO3 */
#define LL_TSC_GROUP5_IO4           TSC_IOCCR_G5_IO4             /*!< TSC Group5 IO4 */

#define LL_TSC_GROUP6_IO1           TSC_IOCCR_G6_IO1             /*!< TSC Group6 IO1 */
#define LL_TSC_GROUP6_IO2           TSC_IOCCR_G6_IO2             /*!< TSC Group6 IO2 */
#define LL_TSC_GROUP6_IO3           TSC_IOCCR_G6_IO3             /*!< TSC Group6 IO3 */
#define LL_TSC_GROUP6_IO4           TSC_IOCCR_G6_IO4             /*!< TSC Group6 IO4 */

#define LL_TSC_GROUP7_IO1           TSC_IOCCR_G7_IO1             /*!< TSC Group7 IO1 */
#define LL_TSC_GROUP7_IO2           TSC_IOCCR_G7_IO2             /*!< TSC Group7 IO2 */
#define LL_TSC_GROUP7_IO3           TSC_IOCCR_G7_IO3             /*!< TSC Group7 IO3 */
#define LL_TSC_GROUP7_IO4           TSC_IOCCR_G7_IO4             /*!< TSC Group7 IO4 */

#if defined(TSC_IOCCR_G8_IO1)
#define LL_TSC_GROUP8_IO1           TSC_IOCCR_G8_IO1             /*!< TSC Group8 IO1 */
#define LL_TSC_GROUP8_IO2           TSC_IOCCR_G8_IO2             /*!< TSC Group8 IO2 */
#define LL_TSC_GROUP8_IO3           TSC_IOCCR_G8_IO3             /*!< TSC Group8 IO3 */
#define LL_TSC_GROUP8_IO4           TSC_IOCCR_G8_IO4             /*!< TSC Group8 IO4 */
#else
#define LL_TSC_GROUP8_IO1           (uint32_t)(0x00000080UL | \
                                               LL_TSC_GROUPX_NOT_SUPPORTED) /*!< TSC Group8 IO1 not supported */
#define LL_TSC_GROUP8_IO2           LL_TSC_GROUP8_IO1            /*!< TSC Group8 IO2 not supported */
#define LL_TSC_GROUP8_IO3           LL_TSC_GROUP8_IO1            /*!< TSC Group8 IO3 not supported */
#define LL_TSC_GROUP8_IO4           LL_TSC_GROUP8_IO1            /*!< TSC Group8 IO4 not supported */
#endif /* TSC_IOCCR_G8_IO1 */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup TSC_LL_Exported_Macros TSC Exported Macros
  * @{
  */

/**
  * @brief  Write a value in TSC register.
  * @param  instance TSC Instance.
  * @param  reg      Register to be written.
  * @param  value    Value to be written in the register.
  */
#define LL_TSC_WRITE_REG(instance, reg, value) WRITE_REG((instance)->reg, (value))

/**
  * @brief  Read a value in TSC register.
  * @param  instance TSC Instance.
  * @param  reg      Register to be read.
  * @retval Register value.
  */
#define LL_TSC_READ_REG(instance, reg) READ_REG((instance)->reg)
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup TSC_LL_Exported_Functions TSC Exported Functions
  * @{
  */

/** @defgroup TSC_LL_EF_Configuration1 Configuration
  * @{
  */

/**
  * @brief Enable the TSC peripheral.
  * @rmtoll
  *  CR          TSCE         LL_TSC_Enable
  * @param  tscx TSC Instance.
  */
__STATIC_INLINE void LL_TSC_Enable(TSC_TypeDef *tscx)
{
  SET_BIT(tscx->CR, TSC_CR_TSCE);
}

/**
  * @brief Disable the TSC peripheral.
  * @rmtoll
  *  CR          TSCE         LL_TSC_Disable
  * @param  tscx TSC Instance.
  */
__STATIC_INLINE void LL_TSC_Disable(TSC_TypeDef *tscx)
{
  CLEAR_BIT(tscx->CR, TSC_CR_TSCE);
}

/**
  * @brief Check if the TSC peripheral is enabled or disabled.
  * @rmtoll
  *  CR          TSCE         LL_TSC_IsEnabled
  * @param  tscx TSC Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TSC_IsEnabled(const TSC_TypeDef *tscx)
{
  return ((READ_BIT(tscx->CR, TSC_CR_TSCE) == (TSC_CR_TSCE)) ? 1UL : 0UL);
}

/**
  * @brief Start Acquisition.
  * @rmtoll
  *  CR          START         LL_TSC_StartAcq
  * @param  tscx TSC Instance.
  */
__STATIC_INLINE void LL_TSC_StartAcq(TSC_TypeDef *tscx)
{
  SET_BIT(tscx->CR, TSC_CR_START);
}

/**
  * @brief Stop Acquisition.
  * @rmtoll
  *  CR          START         LL_TSC_StopAcq
  * @param  tscx TSC Instance.
  */
__STATIC_INLINE void LL_TSC_StopAcq(TSC_TypeDef *tscx)
{
  CLEAR_BIT(tscx->CR, TSC_CR_START);
}

/**
  * @brief Check if the TSC Acquisition is started or Stopped.
  * @rmtoll
  *  CR          START         LL_TSC_IsStartedAcq
  * @param  tscx TSC Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TSC_IsStartedAcq(const TSC_TypeDef *tscx)
{
  return ((READ_BIT(tscx->CR, TSC_CR_START) == (TSC_CR_START)) ? 1UL : 0UL);
}

/**
  * @brief Set Normal Acquisition mode.
  * @rmtoll
  *  CR          AM         LL_TSC_SetNormalAcqMode
  * @param  tscx TSC Instance.
  */
__STATIC_INLINE void LL_TSC_SetNormalAcqMode(TSC_TypeDef *tscx)
{
  CLEAR_BIT(tscx->CR, TSC_CR_AM);
}

/**
  * @brief Set synchronization Acquisition mode.
  * @rmtoll
  *  CR          AM         LL_TSC_SetSynchronizedAcqMode
  * @param  tscx TSC Instance.
  */
__STATIC_INLINE void LL_TSC_SetSynchronizedAcqMode(TSC_TypeDef *tscx)
{
  SET_BIT(tscx->CR, TSC_CR_AM);
}

/**
  * @brief Get Acquisition mode.
  * @rmtoll
  *  CR          AM         LL_TSC_GetAcqMode
  * @param  tscx TSC Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TSC_ACQ_MODE_NORMAL
  *         @arg @ref LL_TSC_ACQ_MODE_SYNCHRO
  */
__STATIC_INLINE uint32_t LL_TSC_GetAcqMode(const TSC_TypeDef *tscx)
{
  return (uint32_t)(READ_BIT(tscx->CR, TSC_CR_AM));
}

/**
  * @brief Set synchronization polarity to falling edge.
  * @rmtoll
  *  CR          SYNCPOL         LL_TSC_SetSyncPolarityFailling
  * @param  tscx TSC Instance.
  */
__STATIC_INLINE void LL_TSC_SetSyncPolarityFailling(TSC_TypeDef *tscx)
{
  CLEAR_BIT(tscx->CR, TSC_CR_SYNCPOL);
}

/**
  * @brief Set synchronization polarity to rising edge.
  * @rmtoll
  *  CR          SYNCPOL         LL_TSC_SetSyncPolarityRising
  * @param  tscx TSC Instance.
  */
__STATIC_INLINE void LL_TSC_SetSyncPolarityRising(TSC_TypeDef *tscx)
{
  SET_BIT(tscx->CR, TSC_CR_SYNCPOL);
}

/**
  * @brief Get synchronization polarity.
  * @rmtoll
  *  CR          SYNCPOL         LL_TSC_GetSyncPolarity
  * @param  tscx TSC Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TSC_SYNC_POLARITY_FALLING
  *         @arg @ref LL_TSC_SYNC_POLARITY_RISING
  */
__STATIC_INLINE uint32_t LL_TSC_GetSyncPolarity(const TSC_TypeDef *tscx)
{
  return (uint32_t)(READ_BIT(tscx->CR, TSC_CR_SYNCPOL));
}

/**
  * @brief Set IO default mode to output push-pull low.
  * @rmtoll
  *  CR          IODEF         LL_TSC_SetIODefaultPushPull
  * @param  tscx TSC Instance.
  */
__STATIC_INLINE void LL_TSC_SetIODefaultPushPull(TSC_TypeDef *tscx)
{
  CLEAR_BIT(tscx->CR, TSC_CR_IODEF);
}

/**
  * @brief Set IO default mode to input floating.
  * @rmtoll
  *  CR          IODEF         LL_TSC_SetIODefaultFloat
  * @param  tscx TSC Instance.
  */
__STATIC_INLINE void LL_TSC_SetIODefaultFloat(TSC_TypeDef *tscx)
{
  SET_BIT(tscx->CR, TSC_CR_IODEF);
}

/**
  * @brief Get IO default mode.
  * @rmtoll
  *  CR          IODEF         LL_TSC_GetIODefaultMode
  * @param  tscx TSC Instance.
  * @retval IReturned value can be one of the following values:
  *         @arg @ref LL_TSC_IODEF_OUT_PP_LOW
  *         @arg @ref LL_TSC_IODEF_IN_FLOAT
  */
__STATIC_INLINE uint32_t LL_TSC_GetIODefaultMode(const TSC_TypeDef *tscx)
{
  return (uint32_t)(READ_BIT(tscx->CR, TSC_CR_IODEF));
}

/**
  * @brief Set Max count Value.
  * @rmtoll
  *  CR          MCV         LL_TSC_SetMaxCountValue
  * @param  tscx TSC Instance.
  * @param  max_count_value max count value, This parameter can be one of the following values:
  *         @arg @ref LL_TSC_MAX_COUNT_VALUE_255
  *         @arg @ref LL_TSC_MAX_COUNT_VALUE_511
  *         @arg @ref LL_TSC_MAX_COUNT_VALUE_1023
  *         @arg @ref LL_TSC_MAX_COUNT_VALUE_2047
  *         @arg @ref LL_TSC_MAX_COUNT_VALUE_4095
  *         @arg @ref LL_TSC_MAX_COUNT_VALUE_8191
  *         @arg @ref LL_TSC_MAX_COUNT_VALUE_16383
  */
__STATIC_INLINE void LL_TSC_SetMaxCountValue(TSC_TypeDef *tscx, const uint32_t max_count_value)
{
  MODIFY_REG(tscx->CR, TSC_CR_MCV, max_count_value);
}

/**
  * @brief Get Max count Value.
  * @rmtoll
  *  CR          MCV         LL_TSC_GetMaxCountValue
  * @param  tscx TSC Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_TSC_MAX_COUNT_VALUE_255
  *         @arg @ref LL_TSC_MAX_COUNT_VALUE_511
  *         @arg @ref LL_TSC_MAX_COUNT_VALUE_1023
  *         @arg @ref LL_TSC_MAX_COUNT_VALUE_2047
  *         @arg @ref LL_TSC_MAX_COUNT_VALUE_4095
  *         @arg @ref LL_TSC_MAX_COUNT_VALUE_8191
  *         @arg @ref LL_TSC_MAX_COUNT_VALUE_16383
  */
__STATIC_INLINE uint32_t LL_TSC_GetMaxCountValue(const TSC_TypeDef *tscx)
{
  return (uint32_t)(READ_BIT(tscx->CR, TSC_CR_MCV));
}

/**
  * @brief Set Pulse Generator Prescaler.
  * @rmtoll
  *  CR          PGPSC         LL_TSC_SetPulseGenPrescaler
  * @param  tscx TSC Instance.
  * @param  pulse_gen_prescaler Pulse Generator Prescaler, This parameter can be one of the following values:
  *         @arg @ref LL_TSC_PULSE_GEN_PRESCALER_DIV1
  *         @arg @ref LL_TSC_PULSE_GEN_PRESCALER_DIV2
  *         @arg @ref LL_TSC_PULSE_GEN_PRESCALER_DIV4
  *         @arg @ref LL_TSC_PULSE_GEN_PRESCALER_DIV8
  *         @arg @ref LL_TSC_PULSE_GEN_PRESCALER_DIV16
  *         @arg @ref LL_TSC_PULSE_GEN_PRESCALER_DIV32
  *         @arg @ref LL_TSC_PULSE_GEN_PRESCALER_DIV64
  *         @arg @ref LL_TSC_PULSE_GEN_PRESCALER_DIV128
  */
__STATIC_INLINE void LL_TSC_SetPulseGenPrescaler(TSC_TypeDef *tscx, const uint32_t pulse_gen_prescaler)
{
  MODIFY_REG(tscx->CR, TSC_CR_PGPSC, pulse_gen_prescaler);
}

/**
  * @brief Get Pulse Generator Prescaler.
  * @rmtoll
  *  CR          PGPSC         LL_TSC_GetPulseGenPrescaler
  * @param  tscx TSC Instance.
  * @retval  returned value can be one of the following values:
  *         @arg @ref LL_TSC_PULSE_GEN_PRESCALER_DIV1
  *         @arg @ref LL_TSC_PULSE_GEN_PRESCALER_DIV2
  *         @arg @ref LL_TSC_PULSE_GEN_PRESCALER_DIV4
  *         @arg @ref LL_TSC_PULSE_GEN_PRESCALER_DIV8
  *         @arg @ref LL_TSC_PULSE_GEN_PRESCALER_DIV16
  *         @arg @ref LL_TSC_PULSE_GEN_PRESCALER_DIV32
  *         @arg @ref LL_TSC_PULSE_GEN_PRESCALER_DIV64
  *         @arg @ref LL_TSC_PULSE_GEN_PRESCALER_DIV128
  */
__STATIC_INLINE uint32_t LL_TSC_GetPulseGenPrescaler(const TSC_TypeDef *tscx)
{
  return (uint32_t)(READ_BIT(tscx->CR, TSC_CR_PGPSC));
}

/**
  * @brief Enable the Spread Spectrum Prescaler.
  * @rmtoll
  *  CR          SSPSC         LL_TSC_EnableSpreadSpecPrescaler
  * @param  tscx TSC Instance.
  */
__STATIC_INLINE void LL_TSC_EnableSpreadSpecPrescaler(TSC_TypeDef *tscx)
{
  SET_BIT(tscx->CR, TSC_CR_SSPSC);
}

/**
  * @brief Disable the Spread Spectrum Prescaler.
  * @rmtoll
  *  CR          SSPSC         LL_TSC_DisableSpreadSpecPrescaler
  * @param  tscx TSC Instance.
  */
__STATIC_INLINE void LL_TSC_DisableSpreadSpecPrescaler(TSC_TypeDef *tscx)
{
  CLEAR_BIT(tscx->CR, TSC_CR_SSPSC);
}

/**
  * @brief Check if Spread Spectrum Prescaler is enabled or disabled.
  * @rmtoll
  *  CR          SSPSC         LL_TSC_IsEnabledSpreadSpecPrescaler
  * @param  tscx TSC Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TSC_IsEnabledSpreadSpecPrescaler(const TSC_TypeDef *tscx)
{
  return ((READ_BIT(tscx->CR, TSC_CR_SSPSC) == (TSC_CR_SSPSC)) ? 1UL : 0UL);
}

/**
  * @brief Enable Spread Spectrum.
  * @rmtoll
  *  CR          SSE         LL_TSC_EnableSpreadSpectrum
  * @param  tscx TSC Instance.
  */
__STATIC_INLINE void LL_TSC_EnableSpreadSpectrum(TSC_TypeDef *tscx)
{
  SET_BIT(tscx->CR, TSC_CR_SSE);
}

/**
  * @brief Disable Spread Spectrum.
  * @rmtoll
  *  CR          SSE         LL_TSC_DisableSpreadSpectrum
  * @param  tscx TSC Instance.
  */
__STATIC_INLINE void LL_TSC_DisableSpreadSpectrum(TSC_TypeDef *tscx)
{
  CLEAR_BIT(tscx->CR, TSC_CR_SSE);
}

/**
  * @brief Check if the Spread Spectrum is enabled or disabled.
  * @rmtoll
  *  CR          SSE         LL_TSC_IsEnabledSpreadSpectrum
  * @param  tscx TSC Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TSC_IsEnabledSpreadSpectrum(const TSC_TypeDef *tscx)
{
  return ((READ_BIT(tscx->CR, TSC_CR_SSE) == (TSC_CR_SSE)) ? 1UL : 0UL);
}

/**
  * @brief Set Spread spectrum deviation.
  * @rmtoll
  *  CR          SSD         LL_TSC_SetSpreadSpecDeviation
  * @param  tscx TSC Instance.
  * @param  spread_spec_deviation Spread spectrum deviation,
  *         This parameter can be be a number between Min_Data = 0 and Max_Data = 127.
  */
__STATIC_INLINE void LL_TSC_SetSpreadSpecDeviation(TSC_TypeDef *tscx, const uint32_t spread_spec_deviation)
{
  MODIFY_REG(tscx->CR, TSC_CR_SSD, spread_spec_deviation);
}

/**
  * @brief Get Spread spectrum deviation.
  * @rmtoll
  *  CR          SSD         LL_TSC_GetSpreadSpecDeviation
  * @param  tscx TSC Instance.
  * @retval Returned value can be be a number between Min_Data = 0 and Max_Data = 127.
  */
__STATIC_INLINE uint32_t LL_TSC_GetSpreadSpecDeviation(const TSC_TypeDef *tscx)
{
  return (uint32_t)(READ_BIT(tscx->CR, TSC_CR_SSD));
}

/**
  * @brief Set Charge transfer pulse low.
  * @rmtoll
  *  CR          CTPL         LL_TSC_SetChargeTransferPulseLow
  * @param  tscx TSC Instance.
  * @param  charge_transfer_pulse_low Charge transfer pulse low, This parameter can be one of the following values:
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_1CYCLE
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_2CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_3CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_4CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_5CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_6CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_7CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_8CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_9CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_10CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_11CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_12CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_13CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_14CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_15CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_16CYCLES
  */
__STATIC_INLINE void LL_TSC_SetChargeTransferPulseLow(TSC_TypeDef *tscx, const uint32_t charge_transfer_pulse_low)
{
  MODIFY_REG(tscx->CR, TSC_CR_CTPL, charge_transfer_pulse_low);
}

/**
  * @brief Get Charge transfer pulse low.
  * @rmtoll
  *  CR          CTPL         LL_TSC_GetChargeTransferPulseLow
  * @param  tscx TSC Instance.
  * @retval returned value can be one of the following values:
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_1CYCLE
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_2CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_3CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_4CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_5CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_6CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_7CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_8CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_9CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_10CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_11CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_12CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_13CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_14CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_15CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_LOW_16CYCLES
  */
__STATIC_INLINE uint32_t LL_TSC_GetChargeTransferPulseLow(const TSC_TypeDef *tscx)
{
  return (uint32_t)(READ_BIT(tscx->CR, TSC_CR_CTPL));
}

/**
  * @brief Set Charge transfer pulse High.
  * @rmtoll
  *  CR          CTPH         LL_TSC_SetChargeTransferPulseHigh
  * @param  tscx TSC Instance.
  * @param  charge_transfer_pulse_high Charge transfer pulse High, This parameter can be one of the following values:
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_1CYCLE
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_2CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_3CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_4CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_5CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_6CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_7CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_8CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_9CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_10CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_11CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_12CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_13CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_14CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_15CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_16CYCLES
  */
__STATIC_INLINE void LL_TSC_SetChargeTransferPulseHigh(TSC_TypeDef *tscx, const uint32_t charge_transfer_pulse_high)
{
  MODIFY_REG(tscx->CR, TSC_CR_CTPH, charge_transfer_pulse_high);
}

/**
  * @brief Get Charge transfer pulse High.
  * @rmtoll
  *  CR          CTPH         LL_TSC_GetChargeTransferPulseHigh
  * @param  tscx TSC Instance.
  * @retval returned value can be one of the following values:
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_1CYCLE
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_2CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_3CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_4CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_5CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_6CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_7CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_8CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_9CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_10CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_11CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_12CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_13CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_14CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_15CYCLES
  *         @arg @ref LL_TSC_CHARGE_TRANSFER_PULSE_HIGH_16CYCLES
  */
__STATIC_INLINE uint32_t LL_TSC_GetChargeTransferPulseHigh(const TSC_TypeDef *tscx)
{
  return (uint32_t)(READ_BIT(tscx->CR, TSC_CR_CTPH));
}

