STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_tsc.h
/**
  * @brief Configure the specified TSC Config.
  * @rmtoll
  *  CR          CTPH         LL_TSC_Config \n
  *  CR          CTPL         LL_TSC_Config \n
  *  CR          PGPSC        LL_TSC_Config \n
  *  CR          MCV          LL_TSC_Config \n
  *  IOCCR       Gx_IOy       LL_TSC_Config \n
  *  IOSCR       Gx_IOy       LL_TSC_Config \n
  *  IOGCSR      GxE          LL_TSC_Config
  * @param  tscx       TSC Instance.
  * @param  cr_config  This parameter can be a combination of the following groups:
  *         @arg @ref TSC_LL_EC_Pulse_Generator_Prescaler
  *         @arg @ref TSC_LL_EC_Charge_Transfer_Pulse_Low
  *         @arg @ref TSC_LL_EC_Charge_Transfer_Pulse_High
  *         @arg @ref TSC_LL_EC_Max_Count_Value
  * @param  channels  This parameter can be a combination of the following group:
  *         @arg @ref TSC_LL_EC_Groups_IOs
  * @param  shields  This parameter can be a combination of the following group:
  *         @arg @ref TSC_LL_EC_Groups_IOs
  * @param  samplings  This parameter can be a combination of the following group:
  *         @arg @ref TSC_LL_EC_Groups_IOs
  */
__STATIC_INLINE void LL_TSC_Config(TSC_TypeDef *tscx, const uint32_t cr_config,
                                   uint32_t channels,
                                   uint32_t shields,
                                   uint32_t samplings)
{
  /* Configure the TSC Pulse */
  MODIFY_REG(tscx->CR, (TSC_CR_CTPH | TSC_CR_CTPL | TSC_CR_PGPSC | TSC_CR_MCV), cr_config);

  /* Set channels and shields IOs */
  SET_BIT(tscx->IOCCR, (channels | shields));

  /* Set samplings IOs */
  SET_BIT(tscx->IOSCR, samplings);

  /* Set groups to be acquired */
  SET_BIT(tscx->IOGCSR, TSC_extract_groups(channels));
}
/**
  * @}
  */

/** @defgroup TSC_LL_EF_IT_Management IT Management
  * @{
  */

/**
  * @brief  Enable EOA interrupt.
  * @rmtoll
  *  IER          EOAIE         LL_TSC_EnableIT_EOA
  * @param  tscx TSC Instance.
  */
__STATIC_INLINE void LL_TSC_EnableIT_EOA(TSC_TypeDef *tscx)
{
  SET_BIT(tscx->IER, TSC_IER_EOAIE);
}

/**
  * @brief  Disable EOA interrupt.
  * @rmtoll
  *  IER          EOAIE         LL_TSC_DisableIT_EOA
  * @param  tscx TSC Instance.
  */
__STATIC_INLINE void LL_TSC_DisableIT_EOA(TSC_TypeDef *tscx)
{
  CLEAR_BIT(tscx->IER, TSC_IER_EOAIE);
}

/**
  * @brief  Check if EOA interrupt is enabled or disabled.
  * @rmtoll
  *  IER          EOAIE         LL_TSC_IsEnabledIT_EOA
  * @param  tscx TSC Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TSC_IsEnabledIT_EOA(const TSC_TypeDef *tscx)
{
  return ((READ_BIT(tscx->IER, TSC_IER_EOAIE) == (TSC_IER_EOAIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable MCE interrupt.
  * @rmtoll
  *  IER          MCEIE         LL_TSC_EnableIT_MCE
  * @param  tscx TSC Instance.
  */
__STATIC_INLINE void LL_TSC_EnableIT_MCE(TSC_TypeDef *tscx)
{
  SET_BIT(tscx->IER, TSC_IER_MCEIE);
}

/**
  * @brief  Disable MCE interrupt.
  * @rmtoll
  *  IER          MCEIE         LL_TSC_DisableIT_MCE
  * @param  tscx TSC Instance.
  */
__STATIC_INLINE void LL_TSC_DisableIT_MCE(TSC_TypeDef *tscx)
{
  CLEAR_BIT(tscx->IER, TSC_IER_MCEIE);
}

/**
  * @brief  Check if MCE interrupt is enabled or disabled.
  * @rmtoll
  *  IER          MCEIE         LL_TSC_IsEnabledIT_MCE
  * @param  tscx TSC Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TSC_IsEnabledIT_MCE(const TSC_TypeDef *tscx)
{
  return ((READ_BIT(tscx->IER, TSC_IER_MCEIE) == (TSC_IER_MCEIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable interrupts.
  * @rmtoll
  *  IER          EOAIE         LL_TSC_EnableIT \n
  *  IER          MCEIE         LL_TSC_EnableIT
  * @param  tscx TSC Instance.
  * @param  interrupts
  *         This parameter can be a combination of the following values:
  *         @arg @ref LL_TSC_IT_EOA
  *         @arg @ref LL_TSC_IT_MCE

  */
__STATIC_INLINE void LL_TSC_EnableIT(TSC_TypeDef *tscx, uint32_t interrupts)
{
  SET_BIT(tscx->IER, interrupts);
}

/**
  * @brief  Disable interrupts.
  * @rmtoll
  *  IER          EOAIE         LL_TSC_DisableIT \n
  *  IER          MCEIE         LL_TSC_DisableIT
  * @param  tscx TSC Instance.
  * @param  interrupts
  *         This parameter can be a combination of the following values:
  *         @arg @ref LL_TSC_IT_EOA
  *         @arg @ref LL_TSC_IT_MCE
  */
__STATIC_INLINE void LL_TSC_DisableIT(TSC_TypeDef *tscx, uint32_t interrupts)
{
  CLEAR_BIT(tscx->IER, interrupts);
}

/**
  * @brief  Check if the interrupts are enabled or disabled.
  * @rmtoll
  *  IER          EOAIE         LL_TSC_IsEnabledIT \n
  *  IER          MCEIE         LL_TSC_IsEnabledIT
  * @param  tscx TSC Instance.
  * @param  interrupts
  *         This parameter can be a combination of the following values :
  *         @arg @ref LL_TSC_IT_EOA
  *         @arg @ref LL_TSC_IT_MCE
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TSC_IsEnabledIT(const TSC_TypeDef *tscx, uint32_t interrupts)
{
  return ((READ_BIT(tscx->IER, interrupts) == (interrupts)) ? 1UL : 0UL);
}
/**
  * @}
  */

/** @defgroup TSC_LL_EF_FLAG_management FLAG management
  * @{
  */

/**
  * @brief Clear EOA flag.
  * @rmtoll
  *  ICR          EOAIC        LL_TSC_ClearFlag_EOA
  * @param  tscx TSC Instance.
  */
__STATIC_INLINE void LL_TSC_ClearFlag_EOA(TSC_TypeDef *tscx)
{
  SET_BIT(tscx->ICR, TSC_ICR_EOAIC);
}

/**
  * @brief Clear MCE flag.
  * @rmtoll
  *  ICR          MCEIC         LL_TSC_ClearFlag_MCE
  * @param  tscx TSC Instance.
  */
__STATIC_INLINE void LL_TSC_ClearFlag_MCE(TSC_TypeDef *tscx)
{
  SET_BIT(tscx->ICR, TSC_ICR_MCEIC);
}

/**
  * @brief Clear flags.
  * @rmtoll
  *  ICR          EOAIC         LL_TSC_ClearFlag \n
  *  ICR          MCEIC         LL_TSC_ClearFlag
  * @param  tscx TSC Instance.
  * @param  flags
  *         This parameter can be a combination of the following values :
  *         @arg @ref LL_TSC_FLAG_EOA
  *         @arg @ref LL_TSC_FLAG_MCE
  */
__STATIC_INLINE void LL_TSC_ClearFlag(TSC_TypeDef *tscx, uint32_t flags)
{
  SET_BIT(tscx->ICR, flags);
}

/**
  * @brief Check whether the EOA flag is activate.
  * @rmtoll
  *  ISR          EOAF         LL_TSC_IsActiveFlag_EOA
  * @param  tscx TSC Instance.
  * @retval State of FLAG sources (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TSC_IsActiveFlag_EOA(const TSC_TypeDef *tscx)
{
  return ((READ_BIT(tscx->ISR, TSC_ISR_EOAF) == (TSC_ISR_EOAF)) ? 1UL : 0UL);
}

/**
  * @brief Check whether the MCE flag is activate.
  * @rmtoll
  *  ISR          MCEF         LL_TSC_IsActiveFlag_MCE
  * @param  tscx TSC Instance.
  * @retval State of FLAG sources (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TSC_IsActiveFlag_MCE(const TSC_TypeDef *tscx)
{
  return ((READ_BIT(tscx->ISR, TSC_ISR_MCEF) == (TSC_ISR_MCEF)) ? 1UL : 0UL);
}

/**
  * @brief Check whether the flags are activate.
  * @rmtoll
  *  ISR          EOAF         LL_TSC_IsActiveFlag \n
  *  ISR          MCEF         LL_TSC_IsActiveFlag
  * @param  tscx TSC Instance.
  * @param  flags
  *         This parameter can be a combination of the following values:
  *         @arg @ref LL_TSC_FLAG_EOA
  *         @arg @ref LL_TSC_FLAG_MCE
  * @retval State of flags sources (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TSC_IsActiveFlag(const TSC_TypeDef *tscx, uint32_t flags)
{
  return ((READ_BIT(tscx->ISR, flags) == (flags)) ? 1UL : 0UL);
}
/**
  * @}
  */

/** @defgroup TSC_LL_EF_Configuration2 Configuration
  * @{
  */

/**
  * @brief Enable schmitt trigger hysteresis on a group of IOs.
  * @rmtoll
  *  IOHCR        Gx_IOy         LL_TSC_EnableHysteresis
  * @param  tscx TSC Instance.
  * @param  gx_ioy_mask IOs mask, This parameter can be a combination of the following values:
  *         @arg @ref LL_TSC_GROUP1_IO1
  *         @arg @ref LL_TSC_GROUP1_IO2
  *         @arg @ref LL_TSC_GROUP1_IO3
  *         @arg @ref LL_TSC_GROUP1_IO4
  *         @arg @ref LL_TSC_GROUP2_IO1
  *         @arg @ref LL_TSC_GROUP2_IO2
  *         @arg @ref LL_TSC_GROUP2_IO3
  *         @arg @ref LL_TSC_GROUP2_IO4
  *         @arg @ref LL_TSC_GROUP3_IO1
  *         @arg @ref LL_TSC_GROUP3_IO2
  *         @arg @ref LL_TSC_GROUP3_IO3
  *         @arg @ref LL_TSC_GROUP3_IO4
  *         @arg @ref LL_TSC_GROUP4_IO1
  *         @arg @ref LL_TSC_GROUP4_IO2
  *         @arg @ref LL_TSC_GROUP4_IO3
  *         @arg @ref LL_TSC_GROUP4_IO4
  *         @arg @ref LL_TSC_GROUP5_IO1
  *         @arg @ref LL_TSC_GROUP5_IO2
  *         @arg @ref LL_TSC_GROUP5_IO3
  *         @arg @ref LL_TSC_GROUP5_IO4
  *         @arg @ref LL_TSC_GROUP6_IO1
  *         @arg @ref LL_TSC_GROUP6_IO2
  *         @arg @ref LL_TSC_GROUP6_IO3
  *         @arg @ref LL_TSC_GROUP6_IO4
  *         @arg @ref LL_TSC_GROUP7_IO1
  *         @arg @ref LL_TSC_GROUP7_IO2
  *         @arg @ref LL_TSC_GROUP7_IO3
  *         @arg @ref LL_TSC_GROUP7_IO4
  *         @arg @ref LL_TSC_GROUP8_IO1
  *         @arg @ref LL_TSC_GROUP8_IO2
  *         @arg @ref LL_TSC_GROUP8_IO3
  *         @arg @ref LL_TSC_GROUP8_IO4
  */
__STATIC_INLINE void LL_TSC_EnableHysteresis(TSC_TypeDef *tscx, const uint32_t gx_ioy_mask)
{
  SET_BIT(tscx->IOHCR, gx_ioy_mask);
}

/**
  * @brief Disable schmitt trigger hysteresis on a group of IOs.
  * @rmtoll
  *  IOHCR        Gx_IOy         LL_TSC_DisableHysteresis
  * @param  tscx TSC Instance.
  * @param  gx_ioy_mask IOs mask, This parameter can be a combination of the following values:
  *         @arg @ref LL_TSC_GROUP1_IO1
  *         @arg @ref LL_TSC_GROUP1_IO2
  *         @arg @ref LL_TSC_GROUP1_IO3
  *         @arg @ref LL_TSC_GROUP1_IO4
  *         @arg @ref LL_TSC_GROUP2_IO1
  *         @arg @ref LL_TSC_GROUP2_IO2
  *         @arg @ref LL_TSC_GROUP2_IO3
  *         @arg @ref LL_TSC_GROUP2_IO4
  *         @arg @ref LL_TSC_GROUP3_IO1
  *         @arg @ref LL_TSC_GROUP3_IO2
  *         @arg @ref LL_TSC_GROUP3_IO3
  *         @arg @ref LL_TSC_GROUP3_IO4
  *         @arg @ref LL_TSC_GROUP4_IO1
  *         @arg @ref LL_TSC_GROUP4_IO2
  *         @arg @ref LL_TSC_GROUP4_IO3
  *         @arg @ref LL_TSC_GROUP4_IO4
  *         @arg @ref LL_TSC_GROUP5_IO1
  *         @arg @ref LL_TSC_GROUP5_IO2
  *         @arg @ref LL_TSC_GROUP5_IO3
  *         @arg @ref LL_TSC_GROUP5_IO4
  *         @arg @ref LL_TSC_GROUP6_IO1
  *         @arg @ref LL_TSC_GROUP6_IO2
  *         @arg @ref LL_TSC_GROUP6_IO3
  *         @arg @ref LL_TSC_GROUP6_IO4
  *         @arg @ref LL_TSC_GROUP7_IO1
  *         @arg @ref LL_TSC_GROUP7_IO2
  *         @arg @ref LL_TSC_GROUP7_IO3
  *         @arg @ref LL_TSC_GROUP7_IO4
  *         @arg @ref LL_TSC_GROUP8_IO1
  *         @arg @ref LL_TSC_GROUP8_IO2
  *         @arg @ref LL_TSC_GROUP8_IO3
  *         @arg @ref LL_TSC_GROUP8_IO4
  */
__STATIC_INLINE void LL_TSC_DisableHysteresis(TSC_TypeDef *tscx, const uint32_t gx_ioy_mask)
{
  CLEAR_BIT(tscx->IOHCR, gx_ioy_mask);
}

/**
  * @brief Check if the Schmitt trigger hysteresis mode is set or not.
  * @rmtoll
  *  IOHCR          Gx_IOy         LL_TSC_IsEnabledHysteresis
  * @param  tscx TSC Instance.
  * @param  gx_ioy_mask IOs mask, This parameter can be a combination of the following values:
  *         @arg @ref LL_TSC_GROUP1_IO1
  *         @arg @ref LL_TSC_GROUP1_IO2
  *         @arg @ref LL_TSC_GROUP1_IO3
  *         @arg @ref LL_TSC_GROUP1_IO4
  *         @arg @ref LL_TSC_GROUP2_IO1
  *         @arg @ref LL_TSC_GROUP2_IO2
  *         @arg @ref LL_TSC_GROUP2_IO3
  *         @arg @ref LL_TSC_GROUP2_IO4
  *         @arg @ref LL_TSC_GROUP3_IO1
  *         @arg @ref LL_TSC_GROUP3_IO2
  *         @arg @ref LL_TSC_GROUP3_IO3
  *         @arg @ref LL_TSC_GROUP3_IO4
  *         @arg @ref LL_TSC_GROUP4_IO1
  *         @arg @ref LL_TSC_GROUP4_IO2
  *         @arg @ref LL_TSC_GROUP4_IO3
  *         @arg @ref LL_TSC_GROUP4_IO4
  *         @arg @ref LL_TSC_GROUP5_IO1
  *         @arg @ref LL_TSC_GROUP5_IO2
  *         @arg @ref LL_TSC_GROUP5_IO3
  *         @arg @ref LL_TSC_GROUP5_IO4
  *         @arg @ref LL_TSC_GROUP6_IO1
  *         @arg @ref LL_TSC_GROUP6_IO2
  *         @arg @ref LL_TSC_GROUP6_IO3
  *         @arg @ref LL_TSC_GROUP6_IO4
  *         @arg @ref LL_TSC_GROUP7_IO1
  *         @arg @ref LL_TSC_GROUP7_IO2
  *         @arg @ref LL_TSC_GROUP7_IO3
  *         @arg @ref LL_TSC_GROUP7_IO4
  *         @arg @ref LL_TSC_GROUP8_IO1
  *         @arg @ref LL_TSC_GROUP8_IO2
  *         @arg @ref LL_TSC_GROUP8_IO3
  *         @arg @ref LL_TSC_GROUP8_IO4
  * @retval State of these bits (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TSC_IsEnabledHysteresis(const TSC_TypeDef *tscx, const uint32_t gx_ioy_mask)
{
  return ((READ_BIT(tscx->IOHCR, gx_ioy_mask) == (gx_ioy_mask)) ? 1UL : 0UL);
}

/**
  * @brief Close analog switch on a group of IOs.
  * @rmtoll
  *  IOASCR        Gx_IOy         LL_TSC_EnableAnalogSwitch
  * @param  tscx TSC Instance.
  * @param  gx_ioy_mask IOs mask, This parameter can be a combination of the following values:
  *         @arg @ref LL_TSC_GROUP1_IO1
  *         @arg @ref LL_TSC_GROUP1_IO2
  *         @arg @ref LL_TSC_GROUP1_IO3
  *         @arg @ref LL_TSC_GROUP1_IO4
  *         @arg @ref LL_TSC_GROUP2_IO1
  *         @arg @ref LL_TSC_GROUP2_IO2
  *         @arg @ref LL_TSC_GROUP2_IO3
  *         @arg @ref LL_TSC_GROUP2_IO4
  *         @arg @ref LL_TSC_GROUP3_IO1
  *         @arg @ref LL_TSC_GROUP3_IO2
  *         @arg @ref LL_TSC_GROUP3_IO3
  *         @arg @ref LL_TSC_GROUP3_IO4
  *         @arg @ref LL_TSC_GROUP4_IO1
  *         @arg @ref LL_TSC_GROUP4_IO2
  *         @arg @ref LL_TSC_GROUP4_IO3
  *         @arg @ref LL_TSC_GROUP4_IO4
  *         @arg @ref LL_TSC_GROUP5_IO1
  *         @arg @ref LL_TSC_GROUP5_IO2
  *         @arg @ref LL_TSC_GROUP5_IO3
  *         @arg @ref LL_TSC_GROUP5_IO4
  *         @arg @ref LL_TSC_GROUP6_IO1
  *         @arg @ref LL_TSC_GROUP6_IO2
  *         @arg @ref LL_TSC_GROUP6_IO3
  *         @arg @ref LL_TSC_GROUP6_IO4
  *         @arg @ref LL_TSC_GROUP7_IO1
  *         @arg @ref LL_TSC_GROUP7_IO2
  *         @arg @ref LL_TSC_GROUP7_IO3
  *         @arg @ref LL_TSC_GROUP7_IO4
  *         @arg @ref LL_TSC_GROUP8_IO1
  *         @arg @ref LL_TSC_GROUP8_IO2
  *         @arg @ref LL_TSC_GROUP8_IO3
  *         @arg @ref LL_TSC_GROUP8_IO4
  */
__STATIC_INLINE void LL_TSC_EnableAnalogSwitch(TSC_TypeDef *tscx, const uint32_t gx_ioy_mask)
{
  SET_BIT(tscx->IOASCR, gx_ioy_mask);
}

/**
  * @brief Open analog switch on a group of IOs.
  * @rmtoll
  *  IOASCR        Gx_IOy         LL_TSC_DisableAnalogSwitch
  * @param  tscx TSC Instance.
  * @param  gx_ioy_mask IOs mask, This parameter can be a combination of the following values:
  *         @arg @ref LL_TSC_GROUP1_IO1
  *         @arg @ref LL_TSC_GROUP1_IO2
  *         @arg @ref LL_TSC_GROUP1_IO3
  *         @arg @ref LL_TSC_GROUP1_IO4
  *         @arg @ref LL_TSC_GROUP2_IO1
  *         @arg @ref LL_TSC_GROUP2_IO2
  *         @arg @ref LL_TSC_GROUP2_IO3
  *         @arg @ref LL_TSC_GROUP2_IO4
  *         @arg @ref LL_TSC_GROUP3_IO1
  *         @arg @ref LL_TSC_GROUP3_IO2
  *         @arg @ref LL_TSC_GROUP3_IO3
  *         @arg @ref LL_TSC_GROUP3_IO4
  *         @arg @ref LL_TSC_GROUP4_IO1
  *         @arg @ref LL_TSC_GROUP4_IO2
  *         @arg @ref LL_TSC_GROUP4_IO3
  *         @arg @ref LL_TSC_GROUP4_IO4
  *         @arg @ref LL_TSC_GROUP5_IO1
  *         @arg @ref LL_TSC_GROUP5_IO2
  *         @arg @ref LL_TSC_GROUP5_IO3
  *         @arg @ref LL_TSC_GROUP5_IO4
  *         @arg @ref LL_TSC_GROUP6_IO1
  *         @arg @ref LL_TSC_GROUP6_IO2
  *         @arg @ref LL_TSC_GROUP6_IO3
  *         @arg @ref LL_TSC_GROUP6_IO4
  *         @arg @ref LL_TSC_GROUP7_IO1
  *         @arg @ref LL_TSC_GROUP7_IO2
  *         @arg @ref LL_TSC_GROUP7_IO3
  *         @arg @ref LL_TSC_GROUP7_IO4
  *         @arg @ref LL_TSC_GROUP8_IO1
  *         @arg @ref LL_TSC_GROUP8_IO2
  *         @arg @ref LL_TSC_GROUP8_IO3
  *         @arg @ref LL_TSC_GROUP8_IO4
  */
__STATIC_INLINE void LL_TSC_DisableAnalogSwitch(TSC_TypeDef *tscx, const uint32_t gx_ioy_mask)
{
  CLEAR_BIT(tscx->IOASCR, gx_ioy_mask);
}

/**
  * @brief Check if the analog switch on a group of IOs is set or not.
  * @rmtoll
  *  IOASCR          Gx_IOy         LL_TSC_IsEnabledAnalogSwitch
  * @param  tscx TSC Instance.
  * @param  gx_ioy_mask IOs mask, This parameter can be a combination of the following values:
  *         @arg @ref LL_TSC_GROUP1_IO1
  *         @arg @ref LL_TSC_GROUP1_IO2
  *         @arg @ref LL_TSC_GROUP1_IO3
  *         @arg @ref LL_TSC_GROUP1_IO4
  *         @arg @ref LL_TSC_GROUP2_IO1
  *         @arg @ref LL_TSC_GROUP2_IO2
  *         @arg @ref LL_TSC_GROUP2_IO3
  *         @arg @ref LL_TSC_GROUP2_IO4
  *         @arg @ref LL_TSC_GROUP3_IO1
  *         @arg @ref LL_TSC_GROUP3_IO2
  *         @arg @ref LL_TSC_GROUP3_IO3
  *         @arg @ref LL_TSC_GROUP3_IO4
  *         @arg @ref LL_TSC_GROUP4_IO1
  *         @arg @ref LL_TSC_GROUP4_IO2
  *         @arg @ref LL_TSC_GROUP4_IO3
  *         @arg @ref LL_TSC_GROUP4_IO4
  *         @arg @ref LL_TSC_GROUP5_IO1
  *         @arg @ref LL_TSC_GROUP5_IO2
  *         @arg @ref LL_TSC_GROUP5_IO3
  *         @arg @ref LL_TSC_GROUP5_IO4
  *         @arg @ref LL_TSC_GROUP6_IO1
  *         @arg @ref LL_TSC_GROUP6_IO2
  *         @arg @ref LL_TSC_GROUP6_IO3
  *         @arg @ref LL_TSC_GROUP6_IO4
  *         @arg @ref LL_TSC_GROUP7_IO1
  *         @arg @ref LL_TSC_GROUP7_IO2
  *         @arg @ref LL_TSC_GROUP7_IO3
  *         @arg @ref LL_TSC_GROUP7_IO4
  *         @arg @ref LL_TSC_GROUP8_IO1
  *         @arg @ref LL_TSC_GROUP8_IO2
  *         @arg @ref LL_TSC_GROUP8_IO3
  *         @arg @ref LL_TSC_GROUP8_IO4
  * @retval State of these bits (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TSC_IsEnabledAnalogSwitch(const TSC_TypeDef *tscx, const uint32_t gx_ioy_mask)
{
  return ((READ_BIT(tscx->IOASCR, gx_ioy_mask) == (gx_ioy_mask)) ? 1UL : 0UL);
}

/**
  * @brief Enable a group of IOs in sampling mode.
  * @rmtoll
  *  IOSCR        Gx_IOy         LL_TSC_EnableSampling
  * @param  tscx TSC Instance.
  * @param  gx_ioy_mask IOs mask, This parameter can be a combination of the following values:
  *         @arg @ref LL_TSC_GROUP1_IO1
  *         @arg @ref LL_TSC_GROUP1_IO2
  *         @arg @ref LL_TSC_GROUP1_IO3
  *         @arg @ref LL_TSC_GROUP1_IO4
  *         @arg @ref LL_TSC_GROUP2_IO1
  *         @arg @ref LL_TSC_GROUP2_IO2
  *         @arg @ref LL_TSC_GROUP2_IO3
  *         @arg @ref LL_TSC_GROUP2_IO4
  *         @arg @ref LL_TSC_GROUP3_IO1
  *         @arg @ref LL_TSC_GROUP3_IO2
  *         @arg @ref LL_TSC_GROUP3_IO3
  *         @arg @ref LL_TSC_GROUP3_IO4
  *         @arg @ref LL_TSC_GROUP4_IO1
  *         @arg @ref LL_TSC_GROUP4_IO2
  *         @arg @ref LL_TSC_GROUP4_IO3
  *         @arg @ref LL_TSC_GROUP4_IO4
  *         @arg @ref LL_TSC_GROUP5_IO1
  *         @arg @ref LL_TSC_GROUP5_IO2
  *         @arg @ref LL_TSC_GROUP5_IO3
  *         @arg @ref LL_TSC_GROUP5_IO4
  *         @arg @ref LL_TSC_GROUP6_IO1
  *         @arg @ref LL_TSC_GROUP6_IO2
  *         @arg @ref LL_TSC_GROUP6_IO3
  *         @arg @ref LL_TSC_GROUP6_IO4
  *         @arg @ref LL_TSC_GROUP7_IO1
  *         @arg @ref LL_TSC_GROUP7_IO2
  *         @arg @ref LL_TSC_GROUP7_IO3
  *         @arg @ref LL_TSC_GROUP7_IO4
  *         @arg @ref LL_TSC_GROUP8_IO1
  *         @arg @ref LL_TSC_GROUP8_IO2
  *         @arg @ref LL_TSC_GROUP8_IO3
  *         @arg @ref LL_TSC_GROUP8_IO4
  */
__STATIC_INLINE void LL_TSC_EnableSampling(TSC_TypeDef *tscx, const uint32_t gx_ioy_mask)
{
  SET_BIT(tscx->IOSCR, gx_ioy_mask);
}

/**
  * @brief Disable a group of sampling IOs.
  * @rmtoll
  *  IOSCR        Gx_IOy         LL_TSC_DisableSampling
  * @param  tscx TSC Instance.
  * @param  gx_ioy_mask IOs mask, This parameter can be a combination of the following values:
  *         @arg @ref LL_TSC_GROUP1_IO1
  *         @arg @ref LL_TSC_GROUP1_IO2
  *         @arg @ref LL_TSC_GROUP1_IO3
  *         @arg @ref LL_TSC_GROUP1_IO4
  *         @arg @ref LL_TSC_GROUP2_IO1
  *         @arg @ref LL_TSC_GROUP2_IO2
  *         @arg @ref LL_TSC_GROUP2_IO3
  *         @arg @ref LL_TSC_GROUP2_IO4
  *         @arg @ref LL_TSC_GROUP3_IO1
  *         @arg @ref LL_TSC_GROUP3_IO2
  *         @arg @ref LL_TSC_GROUP3_IO3
  *         @arg @ref LL_TSC_GROUP3_IO4
  *         @arg @ref LL_TSC_GROUP4_IO1
  *         @arg @ref LL_TSC_GROUP4_IO2
  *         @arg @ref LL_TSC_GROUP4_IO3
  *         @arg @ref LL_TSC_GROUP4_IO4
  *         @arg @ref LL_TSC_GROUP5_IO1
  *         @arg @ref LL_TSC_GROUP5_IO2
  *         @arg @ref LL_TSC_GROUP5_IO3
  *         @arg @ref LL_TSC_GROUP5_IO4
  *         @arg @ref LL_TSC_GROUP6_IO1
  *         @arg @ref LL_TSC_GROUP6_IO2
  *         @arg @ref LL_TSC_GROUP6_IO3
  *         @arg @ref LL_TSC_GROUP6_IO4
  *         @arg @ref LL_TSC_GROUP7_IO1
  *         @arg @ref LL_TSC_GROUP7_IO2
  *         @arg @ref LL_TSC_GROUP7_IO3
  *         @arg @ref LL_TSC_GROUP7_IO4
  *         @arg @ref LL_TSC_GROUP8_IO1
  *         @arg @ref LL_TSC_GROUP8_IO2
  *         @arg @ref LL_TSC_GROUP8_IO3
  *         @arg @ref LL_TSC_GROUP8_IO4
  */
__STATIC_INLINE void LL_TSC_DisableSampling(TSC_TypeDef *tscx, const uint32_t gx_ioy_mask)
{
  CLEAR_BIT(tscx->IOSCR, gx_ioy_mask);
}

/**
  * @brief Check if the sampling IOs is enable or disable.
  * @rmtoll
  *  IOSCR          Gx_IOy         LL_TSC_IsEnabledSampling
  * @param  tscx TSC Instance.
  * @param  gx_ioy_mask IOs mask, This parameter can be a combination of the following values:
  *         @arg @ref LL_TSC_GROUP1_IO1
  *         @arg @ref LL_TSC_GROUP1_IO2
  *         @arg @ref LL_TSC_GROUP1_IO3
  *         @arg @ref LL_TSC_GROUP1_IO4
  *         @arg @ref LL_TSC_GROUP2_IO1
  *         @arg @ref LL_TSC_GROUP2_IO2
  *         @arg @ref LL_TSC_GROUP2_IO3
  *         @arg @ref LL_TSC_GROUP2_IO4
  *         @arg @ref LL_TSC_GROUP3_IO1
  *         @arg @ref LL_TSC_GROUP3_IO2
  *         @arg @ref LL_TSC_GROUP3_IO3
  *         @arg @ref LL_TSC_GROUP3_IO4
  *         @arg @ref LL_TSC_GROUP4_IO1
  *         @arg @ref LL_TSC_GROUP4_IO2
  *         @arg @ref LL_TSC_GROUP4_IO3
  *         @arg @ref LL_TSC_GROUP4_IO4
  *         @arg @ref LL_TSC_GROUP5_IO1
  *         @arg @ref LL_TSC_GROUP5_IO2
  *         @arg @ref LL_TSC_GROUP5_IO3
  *         @arg @ref LL_TSC_GROUP5_IO4
  *         @arg @ref LL_TSC_GROUP6_IO1
  *         @arg @ref LL_TSC_GROUP6_IO2
  *         @arg @ref LL_TSC_GROUP6_IO3
  *         @arg @ref LL_TSC_GROUP6_IO4
  *         @arg @ref LL_TSC_GROUP7_IO1
  *         @arg @ref LL_TSC_GROUP7_IO2
  *         @arg @ref LL_TSC_GROUP7_IO3
  *         @arg @ref LL_TSC_GROUP7_IO4
  *         @arg @ref LL_TSC_GROUP8_IO1
  *         @arg @ref LL_TSC_GROUP8_IO2
  *         @arg @ref LL_TSC_GROUP8_IO3
  *         @arg @ref LL_TSC_GROUP8_IO4
  * @retval State of these bits (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TSC_IsEnabledSampling(const TSC_TypeDef *tscx, const uint32_t gx_ioy_mask)
{
  return ((READ_BIT(tscx->IOSCR, gx_ioy_mask) == (gx_ioy_mask)) ? 1UL : 0UL);
}

