STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_tsc.h
/**
  * @brief Enable a group of IOs in channel mode.
  * @rmtoll
  *  IOCCR        Gx_IOy         LL_TSC_EnableChannel
  * @param  tscx TSC Instance.
  * @param  gx_ioy_mask IOs mask, This parameter can be a combination of the following values:
  *         @arg @ref LL_TSC_GROUP1_IO1
  *         @arg @ref LL_TSC_GROUP1_IO2
  *         @arg @ref LL_TSC_GROUP1_IO3
  *         @arg @ref LL_TSC_GROUP1_IO4
  *         @arg @ref LL_TSC_GROUP2_IO1
  *         @arg @ref LL_TSC_GROUP2_IO2
  *         @arg @ref LL_TSC_GROUP2_IO3
  *         @arg @ref LL_TSC_GROUP2_IO4
  *         @arg @ref LL_TSC_GROUP3_IO1
  *         @arg @ref LL_TSC_GROUP3_IO2
  *         @arg @ref LL_TSC_GROUP3_IO3
  *         @arg @ref LL_TSC_GROUP3_IO4
  *         @arg @ref LL_TSC_GROUP4_IO1
  *         @arg @ref LL_TSC_GROUP4_IO2
  *         @arg @ref LL_TSC_GROUP4_IO3
  *         @arg @ref LL_TSC_GROUP4_IO4
  *         @arg @ref LL_TSC_GROUP5_IO1
  *         @arg @ref LL_TSC_GROUP5_IO2
  *         @arg @ref LL_TSC_GROUP5_IO3
  *         @arg @ref LL_TSC_GROUP5_IO4
  *         @arg @ref LL_TSC_GROUP6_IO1
  *         @arg @ref LL_TSC_GROUP6_IO2
  *         @arg @ref LL_TSC_GROUP6_IO3
  *         @arg @ref LL_TSC_GROUP6_IO4
  *         @arg @ref LL_TSC_GROUP7_IO1
  *         @arg @ref LL_TSC_GROUP7_IO2
  *         @arg @ref LL_TSC_GROUP7_IO3
  *         @arg @ref LL_TSC_GROUP7_IO4
  *         @arg @ref LL_TSC_GROUP8_IO1
  *         @arg @ref LL_TSC_GROUP8_IO2
  *         @arg @ref LL_TSC_GROUP8_IO3
  *         @arg @ref LL_TSC_GROUP8_IO4
  */
__STATIC_INLINE void LL_TSC_EnableChannel(TSC_TypeDef *tscx, const uint32_t gx_ioy_mask)
{
  SET_BIT(tscx->IOCCR, gx_ioy_mask);
}

/**
  * @brief Disable a group of channel IOs.
  * @rmtoll
  *  IOCCR        Gx_IOy         LL_TSC_DisableChannel
  * @param  tscx TSC Instance.
  * @param  gx_ioy_mask IOs mask, This parameter can be a combination of the following values:
  *         @arg @ref LL_TSC_GROUP1_IO1
  *         @arg @ref LL_TSC_GROUP1_IO2
  *         @arg @ref LL_TSC_GROUP1_IO3
  *         @arg @ref LL_TSC_GROUP1_IO4
  *         @arg @ref LL_TSC_GROUP2_IO1
  *         @arg @ref LL_TSC_GROUP2_IO2
  *         @arg @ref LL_TSC_GROUP2_IO3
  *         @arg @ref LL_TSC_GROUP2_IO4
  *         @arg @ref LL_TSC_GROUP3_IO1
  *         @arg @ref LL_TSC_GROUP3_IO2
  *         @arg @ref LL_TSC_GROUP3_IO3
  *         @arg @ref LL_TSC_GROUP3_IO4
  *         @arg @ref LL_TSC_GROUP4_IO1
  *         @arg @ref LL_TSC_GROUP4_IO2
  *         @arg @ref LL_TSC_GROUP4_IO3
  *         @arg @ref LL_TSC_GROUP4_IO4
  *         @arg @ref LL_TSC_GROUP5_IO1
  *         @arg @ref LL_TSC_GROUP5_IO2
  *         @arg @ref LL_TSC_GROUP5_IO3
  *         @arg @ref LL_TSC_GROUP5_IO4
  *         @arg @ref LL_TSC_GROUP6_IO1
  *         @arg @ref LL_TSC_GROUP6_IO2
  *         @arg @ref LL_TSC_GROUP6_IO3
  *         @arg @ref LL_TSC_GROUP6_IO4
  *         @arg @ref LL_TSC_GROUP7_IO1
  *         @arg @ref LL_TSC_GROUP7_IO2
  *         @arg @ref LL_TSC_GROUP7_IO3
  *         @arg @ref LL_TSC_GROUP7_IO4
  *         @arg @ref LL_TSC_GROUP8_IO1
  *         @arg @ref LL_TSC_GROUP8_IO2
  *         @arg @ref LL_TSC_GROUP8_IO3
  *         @arg @ref LL_TSC_GROUP8_IO4
  */
__STATIC_INLINE void LL_TSC_DisableChannel(TSC_TypeDef *tscx, const uint32_t gx_ioy_mask)
{
  CLEAR_BIT(tscx->IOCCR, gx_ioy_mask);
}

/**
  * @brief Check if the Channel IOs is enable or disable.
  * @rmtoll
  *  IOCCR          Gx_IOy         LL_TSC_IsEnabledChannel
  * @param  tscx TSC Instance.
  * @param  gx_ioy_mask IOs mask, This parameter can be a combination of the following values:
  *         @arg @ref LL_TSC_GROUP1_IO1
  *         @arg @ref LL_TSC_GROUP1_IO2
  *         @arg @ref LL_TSC_GROUP1_IO3
  *         @arg @ref LL_TSC_GROUP1_IO4
  *         @arg @ref LL_TSC_GROUP2_IO1
  *         @arg @ref LL_TSC_GROUP2_IO2
  *         @arg @ref LL_TSC_GROUP2_IO3
  *         @arg @ref LL_TSC_GROUP2_IO4
  *         @arg @ref LL_TSC_GROUP3_IO1
  *         @arg @ref LL_TSC_GROUP3_IO2
  *         @arg @ref LL_TSC_GROUP3_IO3
  *         @arg @ref LL_TSC_GROUP3_IO4
  *         @arg @ref LL_TSC_GROUP4_IO1
  *         @arg @ref LL_TSC_GROUP4_IO2
  *         @arg @ref LL_TSC_GROUP4_IO3
  *         @arg @ref LL_TSC_GROUP4_IO4
  *         @arg @ref LL_TSC_GROUP5_IO1
  *         @arg @ref LL_TSC_GROUP5_IO2
  *         @arg @ref LL_TSC_GROUP5_IO3
  *         @arg @ref LL_TSC_GROUP5_IO4
  *         @arg @ref LL_TSC_GROUP6_IO1
  *         @arg @ref LL_TSC_GROUP6_IO2
  *         @arg @ref LL_TSC_GROUP6_IO3
  *         @arg @ref LL_TSC_GROUP6_IO4
  *         @arg @ref LL_TSC_GROUP7_IO1
  *         @arg @ref LL_TSC_GROUP7_IO2
  *         @arg @ref LL_TSC_GROUP7_IO3
  *         @arg @ref LL_TSC_GROUP7_IO4
  *         @arg @ref LL_TSC_GROUP8_IO1
  *         @arg @ref LL_TSC_GROUP8_IO2
  *         @arg @ref LL_TSC_GROUP8_IO3
  *         @arg @ref LL_TSC_GROUP8_IO4
  * @retval State of these bits (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TSC_IsEnabledChannel(const TSC_TypeDef *tscx, const uint32_t gx_ioy_mask)
{
  return ((READ_BIT(tscx->IOCCR, gx_ioy_mask) == (gx_ioy_mask)) ? 1UL : 0UL);
}

/**
  * @brief Enable acquisition groups.
  * @rmtoll
  *  IOGCSR       GxE         LL_TSC_EnableGroup
  * @param  tscx TSC Instance.
  * @param  gx_mask Groups mask, This parameter can be a combination of the following values:
  *         @arg @ref LL_TSC_GROUP1
  *         @arg @ref LL_TSC_GROUP2
  *         @arg @ref LL_TSC_GROUP3
  *         @arg @ref LL_TSC_GROUP4
  *         @arg @ref LL_TSC_GROUP5
  *         @arg @ref LL_TSC_GROUP6
  *         @arg @ref LL_TSC_GROUP7
  * @if TSC_IOCCR_G8_IO1
  *         @arg @ref LL_TSC_GROUP8
  * @endif
  */
__STATIC_INLINE void LL_TSC_EnableGroup(TSC_TypeDef *tscx, const uint32_t gx_mask)
{
  SET_BIT(tscx->IOGCSR, gx_mask);
}

/**
  * @brief Disable acquisition groups.
  * @rmtoll
  *  IOGCSR       GxE         LL_TSC_DisableGroup
  * @param  tscx TSC Instance.
  * @param  gx_mask Groups mask, This parameter can be a combination of the following values:
  *         @arg @ref LL_TSC_GROUP1
  *         @arg @ref LL_TSC_GROUP2
  *         @arg @ref LL_TSC_GROUP3
  *         @arg @ref LL_TSC_GROUP4
  *         @arg @ref LL_TSC_GROUP5
  *         @arg @ref LL_TSC_GROUP6
  *         @arg @ref LL_TSC_GROUP7
  * @if TSC_IOCCR_G8_IO1
  *         @arg @ref LL_TSC_GROUP8
  * @endif
  */
__STATIC_INLINE void LL_TSC_DisableGroup(TSC_TypeDef *tscx, const uint32_t gx_mask)
{
  CLEAR_BIT(tscx->IOGCSR, gx_mask);
}

/**
  * @brief Check if the group is enable or disable.
  * @rmtoll
  *  IOGCSR          Gx_IOy         LL_TSC_IsEnabledGroup
  * @param  tscx TSC Instance.
  * @param  gx_mask Groups mask, This parameter can be a combination of the following values:
  *         @arg @ref LL_TSC_GROUP1
  *         @arg @ref LL_TSC_GROUP2
  *         @arg @ref LL_TSC_GROUP3
  *         @arg @ref LL_TSC_GROUP4
  *         @arg @ref LL_TSC_GROUP5
  *         @arg @ref LL_TSC_GROUP6
  *         @arg @ref LL_TSC_GROUP7
  * @if TSC_IOCCR_G8_IO1
  *         @arg @ref LL_TSC_GROUP8
  * @endif
  * @retval State of these bits (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TSC_IsEnabledGroup(const TSC_TypeDef *tscx, const uint32_t gx_mask)
{
  return ((READ_BIT(tscx->IOGCSR, gx_mask) == (gx_mask)) ? 1UL : 0UL);
}

/**
  * @brief Get acquisition group status.
  * @rmtoll
  *  IOGCSR       GxS         LL_TSC_GetGroupStatus
  * @param  tscx TSC Instance.
  * @param  gx_index Group index, This parameter can be one of the following values:
  *         @arg @ref LL_TSC_GROUP1_IDX
  *         @arg @ref LL_TSC_GROUP2_IDX
  *         @arg @ref LL_TSC_GROUP3_IDX
  *         @arg @ref LL_TSC_GROUP4_IDX
  *         @arg @ref LL_TSC_GROUP5_IDX
  *         @arg @ref LL_TSC_GROUP6_IDX
  *         @arg @ref LL_TSC_GROUP7_IDX
  * @if TSC_IOCCR_G8_IO1
  *         @arg @ref LL_TSC_GROUP8_IDX
  * @endif
  * @retval State of group index (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TSC_GetGroupStatus(const TSC_TypeDef *tscx, const uint32_t gx_index)
{
  return ((READ_BIT(tscx->IOGCSR, (uint32_t)(1UL << (((gx_index) & 0xFUL) + 16UL))) == \
           (uint32_t)(1UL << (((gx_index) & 0xFUL) + 16UL))) ? 1UL : 0UL);
}

/**
  * @brief Get the group acquisition counter.
  * @rmtoll
  *  IOGXCR       CNT         LL_TSC_GetGroupAcquisitionCounter
  * @param  tscx TSC Instance.
  * @param  gx_index Group index, This parameter can be one of the following values:
  *         @arg @ref LL_TSC_GROUP1_IDX
  *         @arg @ref LL_TSC_GROUP2_IDX
  *         @arg @ref LL_TSC_GROUP3_IDX
  *         @arg @ref LL_TSC_GROUP4_IDX
  *         @arg @ref LL_TSC_GROUP5_IDX
  *         @arg @ref LL_TSC_GROUP6_IDX
  *         @arg @ref LL_TSC_GROUP7_IDX
  * @if TSC_IOCCR_G8_IO1
  *         @arg @ref LL_TSC_GROUP8_IDX
  * @endif
  * @retval value of the group acquisition counter.
  */
__STATIC_INLINE uint32_t LL_TSC_GetGroupAcquisitionCounter(const TSC_TypeDef *tscx, const uint32_t gx_index)
{
  return (uint32_t)(READ_BIT(tscx->IOGXCR[gx_index], TSC_IOGXCR_CNT));
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32U5XX_LL_TSC_H */

